Repository: henriquebonfim/website
Catalog: src/shared/i18n/locales/*.po
Languages: es, pt

source: Mobile companion app for truck drivers developed at HackathonCCR. Features route optimization, rest stop finder, and health tracking using React Native with AWS backend services.
es: Aplicación móvil complementaria para camioneros desarrollada en HackathonCCR. Incluye optimización de rutas, buscador de paradas de descanso y seguimiento de salud utilizando React Native con servicios backend de AWS.
pt: Aplicativo móvel para caminhoneiros desenvolvido no HackathonCCR. Possui otimização de rotas, busca de pontos de parada e monitoramento de saúde usando React Native com serviços AWS.

source: Mobile-controlled door access system built with NodeJS microservices, MongoDB, and Arduino integration. Deployed with Docker Swarm for the PET SISTEMAS laboratory.
es: Sistema de acceso a puertas controlado por móvil construido con microservicios NodeJS, MongoDB e integración con Arduino. Desplegado con Docker Swarm para el laboratorio PET SISTEMAS.
pt: Sistema de acesso a portas controlado por celular, construído com microsserviços NodeJS, MongoDB e integração com Arduino. Implantado com Docker Swarm para o laboratório PET SISTEMAS.

source: Modernized KYC stack and optimized OAuth2 and SQL performance.
es: Modernicé la pila KYC y optimicé el rendimiento de OAuth2 y SQL.
pt: Modernizei a stack de KYC e otimizei o desempenho do OAuth2 e SQL.

source: Music
es: Música
pt: Música

source: Open Source
es: Código Abierto
pt: Código Aberto

source: Optimized a Java-based monolith, reduced PostgreSQL storage usage, and achieved 100% test coverage. Also built user-friendly admin interfaces.
es: Optimizó un monolito basado en Java, redujo el uso de almacenamiento PostgreSQL y logró una cobertura de prueba del 100%. También se construyen interfaces de administración fáciles de usar.
pt: Otimizei um monólito em Java, reduzi o uso de armazenamento do PostgreSQL e alcancei 100% de cobertura de testes. Também construí interfaces administrativas amigáveis.

source: Pet Porta App mobile interface for door access control
es: Interfaz móvil de la aplicación Pet Porta para control de acceso a puertas
pt: Interface móvel do Pet Porta App para controle de acesso a portas

source: Piano & Guitar
pt: Piano e Guitarra

source: Portuguese (Native)
es: Portugués (Nativo)
pt: Português (Nativo)

source: Present
es: Presente
pt: Atual

source: Present and Future
pt: Presente e Futuro

source: Professional Experience
es: Experiencia Profesional
pt: Experiência Profissional

source: Professional Summary
es: Resumen Profesional
pt: Resumo Profissional

source: Project {0} of {totalSlides}: {1}
es: Proyecto {0} de {totalSlides}: {1}
pt: Projeto {0} de {totalSlides}: {1}

source: Project carousel slides
es: Diapositivas del carrusel de proyectos
pt: Slides do carrossel de projetos

source: Project list
es: Lista de proyectos
pt: Lista de projetos

source: Projects
es: Proyectos
pt: Projetos

source: Provided help-desk and preventive maintenance.
es: Proporcioné soporte técnico y mantenimiento preventivo.
pt: Prestei suporte técnico e manutenção preventiva.

source: Reach out to me via WhatsApp, Telegram, LinkedIn.
es: Contáctame vía WhatsApp, Telegram o LinkedIn.
pt: Entre em contato pelo WhatsApp, Telegram ou LinkedIn.

source: Refactored CRM modules, cut API latency by 40%.
es: Refactoricé módulos del CRM, reduciendo la latencia de la API en un 40%.
pt: Refatorei módulos do CRM, reduzindo a latência da API em 40%.

source: Resolved 150+ backend/UI issues in SIGPROJ system.
es: Resolví más de 150 problemas de backend/UI en el sistema SIGPROJ.
pt: Resolvi mais de 150 problemas de backend/UI no sistema SIGPROJ.

source: Resolved backend/UI issues and documented APIs and release notes.
es: Resolví problemas de backend/UI y documenté APIs y notas de lanzamiento.
pt: Resolvi problemas de backend/UI e documentei APIs e notas de versão.

source: Resolved over 150 backend and UI issues and contributed to JavaScript/PHP systems. Helped stabilize key platforms and documented APIs.
es: Resolví más de 150 problemas de backend y UI y contribuí a sistemas JavaScript/PHP. Ayudé a estabilizar plataformas clave y documenté APIs.
pt: Resolvi mais de 150 problemas de backend e UI e contribuí para sistemas em JavaScript/PHP. Ajudei a estabilizar plataformas-chave e documentei APIs.

source: Resume
es: Currículo
pt: Currículo

source: Roça Eats platform interface showing food donation management system
es: Interfaz de la plataforma Roça Eats mostrando el sistema de gestión de donaciones de alimentos
pt: Interface da plataforma Roça Eats mostrando sistema de gestão de doações de alimentos

source: Scrum Foundation Professional Certification (SFPC™)
es: Certificación Profesional de Scrum Foundation (SFPC™)
pt: Certificação Profissional Scrum Foundation (SFPC™)

source: Senior Software Engineer
es: Ingeniero de Software Senior
pt: Engenheiro de Software Sênior

source: Senior Software Engineer – Meu Financiamento Solar
es: Ingeniero de Software Senior – Meu Financiamento Solar
pt: Engenheiro de Software Sênior – Meu Financiamento Solar

source: Senior Software Engineer with 10+ years of experience in full-stack development (JavaScript, TypeScript, Node.js). Expertise in scalable microservices, serverless, and event-driven architectures. Proven success across fintech, government, and startups, with a passion for generative AI and performance optimization.
es: Ingeniero de Software Senior con más de 10 años de experiencia en desarrollo full-stack (JavaScript, TypeScript, Node.js). Experto en microservicios escalables, arquitecturas serverless y basadas en eventos. Éxito comprobado en fintech, gobierno y startups, con pasión por la IA generativa y la optimización del rendimiento.
pt: Engenheiro de Software Sênior com mais de 10 anos de experiência em desenvolvimento full-stack (JavaScript, TypeScript, Node.js). Especialista em microsserviços escaláveis, serverless e arquiteturas orientadas a eventos. Sucesso comprovado em fintechs, governo e startups, com paixão por IA generativa e otimização de performance.

source: Some of my projects that showcase my skills
es: Algunos de mis proyectos que muestran mis habilidades
pt: Alguns dos meus projetos que demonstram minhas habilidades

source: Spanish (Basic)
es: Español (Basic)
pt: Espanhol (Básico)

source: Started as Assistent Computer Support Technician at Sedit. Learned helpdesk skills, preventive maintenance, and how to troubleshoot under pressure.
es: Comencé como Técnico Asistente de Soporte Informático en Sedit. Aprendí habilidades de helpdesk, mantenimiento preventivo y cómo resolver problemas bajo presión.
pt: Comecei como Técnico de Suporte em Informática Assistente na Sedit. Aprendi habilidades de helpdesk, manutenção preventiva e como solucionar problemas sob pressão.

source: Startup Failed
es: Startup Fallida
pt: Startup Fracassada

source: Switch language to {value}
es: Cambiar idioma a {value}
pt: Mudar idioma para {value}

source: Switch to {0} theme
es: Cambiar al tema {0}
pt: Mudar para o tema {0}

source: Tab navigation
es: Navegación por pestañas
pt: Navegação por abas

source: Technical Support Assistant
es: Asistente de Soporte Técnico
pt: Assistente de Suporte Técnico

source: The boy becomes a man
es: El chico se convierte en un hombre
pt: O rapaz torna-se um homem

source: The start of the pandemic in 2020 was challenging, but I turned this period into an opportunity. I dedicated myself to studying Cloud Computing and Machine Learning, playing with IBM Watson and TensorFlow. I even tried to create a startup (Softstate Solutions), which didn't work out due to a lack of clients. That failure taught me a lot and motivated me to keep going.
es: El comienzo de la pandemia en 2020 fue un reto, pero convertí este período en una oportunidad. Me dedicé a estudiar Cloud Computing y Machine Learning, jugando con IBM Watson y TensorFlow. Incluso intenté crear una startup (Softstate Solutions), que no funcionó debido a la falta de clientes. Ese fracaso me enseñó mucho y me motivó a seguir adelante.
pt: O início da pandemia em 2020 foi um desafio, mas transformei este período numa oportunidade. Dediquei-me a estudar Cloud Computing e Machine Learning, jogando com IBM Watson e TensorFlow. Até tentei criar uma startup (Softstate Solutions), que não deu certo devido à falta de clientes. Esse fracasso me ensinou muito e me motivou a continuar.

source: Theme Toggle Icon
es: Icono de Cambio de Tema
pt: Ícone de alternância de tema

source: This is me!
es: ¡Este soy yo!
pt: Este sou eu!

source: Timeline
es: Cronología
pt: Linha do Tempo

source: Took the first computer literacy course. Graduated from the <0>Work Education Program by Coca-Cola</0>. Also started learning to play acoustic guitar, which became a lifelong passion.
es: Tomé el primer curso de alfabetización informática. Me gradué del <0>Programa de Educación Laboral de Coca-Cola</0>. También comencé a aprender a tocar la guitarra acústica, que se convirtió en una pasión de por vida.
pt: Fiz o primeiro curso de informática. Me formei no <0>Programa Educação para o Trabalho da Coca-Cola</0>. Também comecei a aprender violão, que se tornou uma paixão para a vida toda.

source: Tried launching my own product but struggled with getting clients.
es: Traté de lanzar mi propio producto pero luchó con conseguir clientes.
pt: Tentei lançar meu próprio produto, mas tive dificuldades para conseguir clientes.

source: University Begins
es: Comienza la Universidad
pt: Início da Universidade

source: Upwork – Senior Software Engineer
es: Upwork – Ingeniero de Software Senior
pt: Upwork – Engenheiro de Software Sênior

source: Used Redis/RabbitMQ for distributed microservices.
es: Utilicé Redis/RabbitMQ para microservicios distribuidos.
pt: Utilizei Redis/RabbitMQ para microsserviços distribuídos.

source: Website logo
es: Logo del sitio web
pt: Logo do site

source: Website Main Content
es: Contenido Principal del Sitio Web
pt: Conteúdo Principal do Site

source: Workana – Senior Backend Engineer
es: Workana – Ingeniero Backend Senior
pt: Workana – Engenheiro Backend Sênior

source: AWS Certified Cloud Practitioner
es: AWS Cloud Practitioner Certificado

source: Docker Essentials – IBM
es: Fundamentos de Docker – IBM

source: Google Cloud Certified – Associate Cloud Engineer
es: Certificado de Google Cloud – Ingeniero Asociado en la Nube

source: Google Cloud Innovators
es: Innovadores de Google Cloud

source: Jan
es: Ene
