Repository: henriquebonfim/website
Catalog: src/shared/i18n/locales/*.po
Languages: es, pt

source: '10+ years in software development'
es: 'Más de 10 años en desarrollo de software'
pt: '10+ anos em desenvolvimento de software'

source: A carousel of tools and technologies
es: Un carrusel de herramientas y tecnologías
pt: Um carrossel de ferramentas e tecnologias

source: About
es: Acerca
pt: Sobre

source: About me
es: Sobre mí
pt: Sobre mim

source: Alongside technology, music occupies a special place in my life. I play piano and guitar, and have learned several other instruments. I've performed with other artists, in street bands and at public events. This passion reinforces my philosophy of lifelong learning and my ability to constantly adapt.
es: Junto a la tecnología, la música ocupa un lugar especial en mi vida. Toco piano y guitarra, y he aprendido varios otros instrumentos. He actuado con otros artistas, en bandas callejeras y en eventos públicos. Esta pasión refuerza mi filosofía del aprendizaje permanente y mi capacidad para adaptarse constantemente.
pt: Ao lado da tecnologia, a música ocupa um lugar especial na minha vida. Toco piano e violão, e aprendi vários outros instrumentos. Já me apresentei com outros artistas, em bandas de rua e em eventos públicos. Esta paixão reforça a minha filosofia de aprendizagem ao longo da vida e a minha capacidade de adaptação constante.

source: App
es: Aplicación
pt: Aplicativo

source: Application
es: Aplicación
pt: Aplicação

source: Apr
es: Abr
pt: Abr

source: Architected B2B AI integrations with legacy systems (NDA).
es: Arquitecté integraciones de IA B2B con sistemas heredados (NDA).
pt: Arquitetei integrações B2B de IA com sistemas legados (NDA).

source: ArduEVE IoT automation system interface showing real-time sensor data
es: Interfaz del sistema de automatización IoT ArduEVE mostrando datos de sensores en tiempo real
pt: Interface do sistema de automação IoT ArduEVE mostrando dados dos sensores em tempo real

source: At the age of 17 (2013), I took a technical course in computer maintenance offered by Intel. This earned me my first job as a technical support assistant at the Sedit hemodialysis clinic, where I discovered the world of help desk and customer service. In 2015, at the age of 19, I put everything together and moved to Campo Grande, MS, to study Information Systems at UFMS.
es: A la edad de 17 (2013), tomé un curso técnico en mantenimiento informático ofrecido por Intel. Esto me ganó mi primer trabajo como asistente de apoyo técnico en la clínica de hemodialisis de Sedit, donde descubrí el mundo de la asistencia y el servicio al cliente. En 2015, a la edad de 19 años, coloqué todo y me mudé a Campo Grande, MS, para estudiar Sistemas de Información en UFMS.
pt: Aos 17 anos (2013), fiz um curso técnico em manutenção de computadores oferecido pela Intel. Isso me valeu meu primeiro emprego como assistente de suporte técnico na clínica de hemodiálise Sedit, onde descobri o mundo da mesa de ajuda e serviço ao cliente. Em 2015, aos 19 anos, juntei tudo e me mudei para Campo Grande, MS, para estudar Sistemas de Informação na UFMS.

source: Aug
es: Ago
pt: Ago

source: Author credit
es: Crédito de autor
pt: Crédito do autor

source: AWS re/Start Graduate
es: Graduado de AWS re/Start
pt: Graduado AWS re/Start

source: Beyond Code
es: Más allá del Código
pt: Além do código

source: Blockchain-based legal contract platform recognized in Top 50 at Megahack v2 2020. Implements NodeJS, Angular, and Google Cloud to ensure transparent, tamper-proof digital agreements with legal validity.
es: Plataforma de contratos legales basada en blockchain reconocida en el Top 50 de Megahack v2 2020. Implementa NodeJS, Angular y Google Cloud para garantizar acuerdos digitales transparentes e inviolables con validez legal.
pt: Plataforma de contratos legais baseada em blockchain reconhecida no Top 50 do Megahack v2 2020. Utiliza NodeJS, Angular e Google Cloud para garantir acordos digitais transparentes e invioláveis com validade jurídica.

source: Building solutions that make a difference
es: Construcción de soluciones que marcan la diferencia
pt: Construindo soluções que fazem a diferença

source: Built a soapbox car from scraps and spent countless hours on LAN matches of Counter-Strike: Condition Zero. This playful creativity planted the seed for an engineering mindset.
es: Construí un coche de carreras con chatarra y pasé incontables horas en partidas LAN de Counter-Strike: Condition Zero. Esta creatividad lúdica sembró la semilla de una mentalidad de ingeniería.
pt: Construí um carrinho de rolimã com sucata e passei incontáveis horas em partidas LAN de Counter-Strike: Condition Zero. Essa criatividade lúdica plantou a semente do pensamento de engenheiro.

source: Built admin interfaces with JavaScript and Bootstrap.
es: Construí interfaces administrativas con JavaScript y Bootstrap.
pt: Construí interfaces administrativas com JavaScript e Bootstrap.

source: Built agribusiness dashboards with JavaScript/Bootstrap.
es: Desarrollé tableros para agronegocios con JavaScript/Bootstrap.
pt: Desenvolvi dashboards para agronegócio com JavaScript/Bootstrap.

source: Built REST APIs with Nest.js/PostgreSQL, ensured 99.98% uptime.
es: Construí APIs REST con Nest.js/PostgreSQL, asegurando un 99.98% de disponibilidad.
pt: Desenvolvi APIs REST com Nest.js/PostgreSQL, garantindo 99,98% de disponibilidade.

source: Campinho Digital — Cloud Computing (Sep 2023 – Dec 2023)
es: Campinho Digital — Computación en la Nube (Sep 2023 – Dic 2023)
pt: Campinho Digital — Computação em Nuvem (Set 2023 – Dez 2023)

source: Canivete Perneta mobile app interface showing truck driver assistance features
es: Interfaz de la app móvil Canivete Perneta mostrando funciones de asistencia para camioneros
pt: Interface do app Canivete Perneta mostrando recursos de assistência ao caminhoneiro

source: Carousel of tools and technologies used by Henrique Bonfim
es: Carrusel de herramientas y tecnologías usadas por Henrique Bonfim
pt: Carrossel de ferramentas e tecnologias usadas por Henrique Bonfim

source: Certifications
es: Certificaciones
pt: Certificações

source: Childhood Creativity
es: Creatividad en la infancia
pt: Criatividade na Infância

source: Click to change theme to {0} mode
es: Haz clic para cambiar al modo {0}
pt: Clique para mudar para o tema {0}

source: Completed AWS re/Start program and earned AWS Certified Cloud Practitioner. Learned foundational cloud concepts and DevOps workflows.
es: Completé el programa AWS re/Start y obtuve la certificación AWS Certified Cloud Practitioner. Aprendí conceptos fundamentales de la nube y flujos de trabajo DevOps.
pt: Completei o programa AWS re/Start e obtive a certificação AWS Cloud Practitioner. Aprendi conceitos fundamentais de cloud e workflows DevOps.

source: Completed the Get Certified Program. Became a Google Associate Cloud Engineer, expanding my skills across GCP services and infrastructure.
es: Completé el programa Get Certified. Me convertí en Google Associate Cloud Engineer, ampliando mis habilidades en servicios e infraestructura de GCP.
pt: Completei o Programa Get Certified. Me tornei um Google Associate Cloud Engineer, expandindo minhas habilidades em serviços e infraestrutura GCP.

source: Contact
es: Contacto
pt: Contato

source: Contact methods
es: Métodos de contacto
pt: Métodos de contato

source: Contact via LinkedIn
es: Contactar vía LinkedIn
pt: Contato via LinkedIn

source: Contact via Telegram
es: Contactar vía Telegram
pt: Contato via Telegram

source: Contact via WhatsApp
es: Contactar vía WhatsApp
pt: Contato via WhatsApp

source: Creative Childhood
es: Infancia Creativa
pt: Infância Criativa

source: Dec
es: Dic
pt: Dez

source: Delivering backend, API, and documentation excellence to global clients. Helping startups grow with clean code, cloud infra, and fast delivery.
es: Entregando excelencia en backend, API y documentación a clientes globales. Ayudando a startups a crecer con código limpio, infraestructura en la nube y entregas rápidas.
pt: Entregando excelência em backend, API e documentação para clientes globais. Ajudando startups a crescerem com código limpo, infraestrutura em nuvem e entregas rápidas.

source: Designed scalable microservices, built APIs with Nest.js, and integrated AI with legacy systems. Delivered enterprise-grade uptime and stability.
es: Diseñé microservicios escalables, construí APIs con Nest.js e integré IA con sistemas heredados. Entregué disponibilidad y estabilidad de nivel empresarial.
pt: Projetei microsserviços escaláveis, construí APIs com Nest.js e integrei IA com sistemas legados. Entreguei disponibilidade e estabilidade em nível empresarial.

source: Despite the business not taking off, I won the Hackatrouble hackathon with an Uber Eats-style solution—proving innovation never goes to waste.
es: A pesar de que el negocio no despegó, gané el hackathon Hackatrouble con una solución estilo Uber Eats, demostrando que la innovación nunca se desperdicia.
pt: Apesar do negócio não ter decolado, ganhei o hackathon Hackatrouble com uma solução estilo Uber Eats—provando que inovação nunca é desperdiçada.

source: Developed dashboards and admin tools with JavaScript and Bootstrap. Improved user experience and honed frontend-backend collaboration.
es: Desarrollé tableros e interfaces administrativas con JavaScript y Bootstrap. Mejoré la experiencia del usuario y perfeccioné la colaboración frontend-backend.
pt: Desenvolvi dashboards e ferramentas administrativas com JavaScript e Bootstrap. Melhorei a experiência do usuário e aprimorei a colaboração frontend-backend.

source: Developed dashboards using React and Chart.js.
es: Desarrollé tableros utilizando React y Chart.js.
pt: Desenvolvi dashboards usando React e Chart.js.

source: Developed modules in JavaScript and PHP.
es: Desarrollé módulos en JavaScript y PHP.
pt: Desenvolvi módulos em JavaScript e PHP.

source: Developing Secure Software – Linux Foundation
es: Desarrollo de Software Seguro – Linux Foundation
pt: Desenvolvimento de Software Seguro – Linux Foundation

source: Download {name}
es: Descargar {name}
pt: Baixar {name}

source: During my degree, I dived headfirst into opportunities: I took part in the PET (Tutorial Education Program), university expansion projects, CTEI, AGETIC and FETEC. In 2018, I took part in programming competitions, winning third place in one of them.
es: Durante mi grado, me sumergí primero en oportunidades: Participé en el PET (Programa de Educación Tutorial), proyectos de expansión universitaria, CTEI, AGETIC y FETEC. En 2018, participé en concursos de programación, ganando tercer lugar en uno de ellos.
pt: Durante o meu curso, mergulhei de cabeça em oportunidades: Participei do PET (Programa de Educação Tutorial), projetos de expansão universitária, CTEI, AGETIC e FETEC. Em 2018, participei em competições de programação, ganhando o terceiro lugar em uma delas.

source: Early 2000s
es: Principios de los 2000
pt: Início dos anos 2000

source: Education
es: Educación
pt: Educação

source: English (Fluent)
es: Inglés (Fluido)
pt: Inglês (Fluente)

source: Enrolled in the Information Systems bachelor's program at UFMS. Gained foundational knowledge in software engineering, foundations in algorithms, databases, and system design.
es: Me inscribí en el programa de licenciatura en Sistemas de Información en la UFMS. Adquirí conocimientos fundamentales en ingeniería de software, fundamentos en algoritmos, bases de datos y diseño de sistemas.
pt: Ingressei no curso de Sistemas de Informação na UFMS. Adquiri conhecimentos fundamentais em engenharia de software, algoritmos, bancos de dados e design de sistemas.

source: Feb
pt: Fev

source: Federal University of Mato Grosso do Sul — Bachelor's in Information Systems (Jan 2015 – Dec 2019)
es: Universidad Federal de Mato Grosso do Sul — Licenciatura en Sistemas de Información (Ene 2015 – Dic 2019)
pt: Universidade Federal de Mato Grosso do Sul — Bacharel em Sistemas de Informação (Jan 2015 – Dez 2019)

source: First contact with tech and education program
es: Primer contacto con la tecnología y programa educativo
pt: Primeiro contato com tecnologia e programa educacional

source: First IT Job
es: Primer trabajo en TI
pt: Primeiro Emprego em TI

source: First Step into Love
es: Primer paso hacia el amor
pt: Primeiro Passo no Amor

source: flag of {value}
es: bandera de {value}
pt: bandeira de {value}

source: Follow on {name}
es: Seguir en {name}
pt: Seguir no {name}

source: Freelance Work at Upwork – Senior Software Engineer
es: Trabajo freelance en Upwork – Ingeniero de Software Senior
pt: Trabalho Freelance na Upwork – Engenheiro de Software Sênior

source: Fresh start
es: Comienzo fresco
pt: Novo início

source: Full-Stack Mid-Level at Portal Solar
es: Desarrollador Full-Stack de nivel medio en Portal Solar
pt: Desenvolvedor Full-Stack Pleno no Portal Solar

source: GitHub profile of Henrique Bonfim
es: Perfil de GitHub de Henrique Bonfim
pt: Perfil do GitHub de Henrique Bonfim

source: Growth in the midst of chaos
es: Crecimiento en medio del caos
pt: Crescimento no meio do caos

source: Hackatrouble SP 2020 award-winning platform connecting rural farmers with charity organizations to reduce food waste. Built with NodeJS, Angular, and AWS for scalable donation management.
es: Plataforma galardonada Hackatrouble SP 2020 que conecta a agricultores rurales con organizaciones benéficas para reducir el desperdicio de alimentos. Construida con NodeJS, Angular y AWS para una gestión de donaciones escalable.
pt: Plataforma premiada no Hackatrouble SP 2020 que conecta agricultores rurais com organizações beneficentes para reduzir o desperdício de alimentos. Construída com NodeJS, Angular e AWS para gestão escalável de doações.

source: Hackatrouble Win
es: Victoria en Hackatrouble
pt: Vitória no Hackatrouble

source: heart
es: corazón
pt: coração

source: Help Topics: Windows
es: Temas de ayuda: Windows
pt: Tópicos de Ajuda: Windows

source: Henrique as a child
es: Henrique como niño
pt: Henrique quando criança

source: Henrique Avatar
es: Avatar de Henrique
pt: Avatar do Henrique

source: Henrique Bonfim Profile on top left
es: Perfil de Henrique Bonfim en la parte superior izquierda
pt: Perfil de Henrique Bonfim no topo à esquerda

source: Henrique coding
es: Codificación Henrique
pt: Código Henrique

source: Henrique eating
es: Henrique comiendo
pt: Henrique comendo

source: Henrique flying
es: Henrique volando
pt: Henrique voando

source: Henrique formal
pt: Formal Henrique

source: Henrique having lunch, smiling and hungry, 2023
es: Henrique almorzando, sonriendo y hambriento, 2023
pt: Henrique almoçando, sorrindo e com fome, 2023

source: Henrique location
es: Ubicación de Henrique
pt: Localização do Henrique

source: Henrique over the years
es: Henrique a través de los años
pt: Henrique ao longo dos anos

source: Henrique photo
es: Foto de Henrique
pt: Foto do Henrique

source: Henrique playing guitar
es: Henrique tocando guitarra
pt: Henrique tocando guitarra

source: Henrique playing organ
es: Henrique tocando órgano
pt: Henrique brincando de órgão

source: Henrique playing piano
es: Henrique tocando el piano
pt: Henrique tocando piano

source: Henrique Profile
es: Perfil de Henrique
pt: Perfil do Henrique

source: I also got involved with incubators such as IndexT, Codate and LivingLab, where I was finally able to work as a systems developer - it was exactly where I wanted to be.
pt: Também me envolvi com incubadoras como IndexT, Codate e LivingLab, onde finalmente pude trabalhar como desenvolvedor de sistemas - era exatamente onde eu queria estar.

source: I always strive to carry out projects that bring real value to society, combining my technical expertise in Cloud, AI and development with agile methodologies.
es: Siempre me esfuerzo por llevar a cabo proyectos que aportan valor real a la sociedad, combinando mi experiencia técnica en Cloud, AI y desarrollo con metodologías ágiles.
pt: Eu sempre me esforço para realizar projetos que tragam valor real à sociedade, combinando minha experiência técnica em Cloud, IA e desenvolvimento com metodologias ágeis.

source: I believe that technology should make a difference to people's lives - and that's what drives me every day.
es: Creo que la tecnología debe marcar la diferencia en la vida de la gente y eso es lo que me impulsa todos los días.
pt: Acredito que a tecnologia deve fazer a diferença na vida das pessoas e é isso que me motiva todos os dias.

source: I was an energetic child who learned quickly, observing and listening to everything that fascinated me. I think one of my greatest childhood achievements was building a soapbox car out of scraps and learning to play the guitar. I was always fascinated by doing things that were out of the ordinary, at least for me.
es: Fui un niño enérgico que aprendió rápidamente, observando y escuchando todo lo que me fascinaba. Creo que uno de mis mayores logros en la infancia fue la construcción de un coche de jabón fuera de chatarras y aprender a tocar la guitarra. Siempre estaba fascinado por hacer cosas que estaban fuera de lo común, al menos para mí.
pt: Eu era uma criança enérgica que aprendia rapidamente, observando e ouvindo tudo o que me fascinava. Acho que uma das minhas maiores conquistas na infância foi construir um carro com sucatas e aprender a tocar guitarra. Sempre fiquei fascinado por fazer coisas fora do comum, pelo menos para mim.

source: I went on to work for companies like Portal Solar and Meu Financiamento Solar, where I really consolidated my experience as a senior developer. At Portal Solar, I maintained high-traffic applications that served 100,000 photovoltaic installers in Brazil. At Meu Financiamento Solar, I contributed to the entire SDLC of the country's largest solar credit acquisition platform, helping to increase engagement by 300% after launch. In 2023, I was selected for AWS re/Start, an intensive cloud immersion program that earned me my first AWS certificate. The following year, I took part in Google Cloud - Get Certified, earning my Associate Cloud Engineer certification.
pt: Passei a trabalhar para empresas como Portal Solar e Meu Financiamento Solar, onde realmente consolidei minha experiência como desenvolvedor sênior. No Portal Solar, mantive aplicações de alto tráfego que atenderam 100.000 instaladores fotovoltaicos no Brasil. No Meu Financiamento Solar, eu contribuí para todo o SDLC da maior plataforma de aquisição de crédito solar do país, ajudando a aumentar o engajamento em 300% após o lançamento. Em 2023, fui selecionado para o AWS re/Start, um programa intensivo de imersão em nuvem que me valeu meu primeiro certificado AWS. No ano seguinte, participei do Google Cloud - Get Certified, ganhando minha certificação de Engenheiro de Nuvem Associado.

source: If you want to know more about my work, check out my <0>Projects</0>.
es: Si quieres saber más sobre mi trabajo, echa un vistazo a mi "Proyectos" [0].
pt: Se você quiser saber mais sobre meu trabalho, confira meu <0>Projetos</0>.

source: Image carousel showcasing Henrique's journey
es: Imagen carrusel mostrando el viaje de Henrique
pt: Imagem carrossel mostrando viagem de Henrique

source: Improved platform stability and facilitated project alignment.
es: Mejoré la estabilidad de la plataforma y facilité la alineación de proyectos.
pt: Melhorei a estabilidade da plataforma e facilitei o alinhamento do projeto.

source: IoT automation system using microservices architecture with NodeJS, VueJS, and MongoDB. Controls electronic relays for lighting and door access while providing real-time sensor monitoring through Docker Swarm deployment.
es: Sistema de automatización IoT utilizando arquitectura de microservicios con NodeJS, VueJS y MongoDB. Controla los relés electrónicos para la iluminación y el acceso a las puertas, mientras que proporciona monitoreo de sensores en tiempo real a través del despliegue de Docker Swarm.
pt: Sistema de automação IoT usando arquitetura de microsserviços com NodeJS, VueJS e MongoDB. Controla relés eletrônicos para iluminação e acesso a portas enquanto fornece monitoramento de sensores em tempo real por meio de implantação Docker Swarm.

source: Junior Dev at Indext
es: Desarrollador Junior en Indext
pt: Desenvolvedor Júnior na Indext

source: Junior Developer – LEDES
es: Desarrollador Junior – LEDES
pt: Desenvolvedor Júnior – LEDES

source: Junior Software Developer
es: Desarrollador de Software Junior
pt: Desenvolvedor de Software Júnior

source: Key Skills
es: Habilidades Clave
pt: Habilidades Principais

source: Language Switcher
es: Selector de Idioma
pt: Alternador de Idioma

source: Languages
es: Idiomas
pt: Idiomas

source: Launched solar credit platform with 300% engagement growth.
es: Lancé una plataforma de créditos solares con un crecimiento del 300% en el compromiso.
pt: Lancei plataforma de crédito solar com crescimento de engajamento de 300%.

source: Leadership, Problem-solving, Team Management, Critical Thinking
es: Liderazgo, Resolución de Problemas, Gestión de Equipos, Pensamiento Crítico
pt: Liderança, Resolução de Problemas, Gestão de Equipes, Pensamento Crítico

source: Led development for Brazil’s largest solar credit platform. Improved OAuth2 security, scaled KYC systems, and mentored junior devs.
es: Lideré el desarrollo de la plataforma de créditos solares más grande de Brasil. Mejoré la seguridad de OAuth2, escalé sistemas KYC y mentoreé a desarrolladores junior.
pt: Liderei o desenvolvimento da maior plataforma de crédito solar do Brasil. Melhorei a segurança do OAuth2, escalei sistemas KYC e mentorei desenvolvedores juniores.

source: Let's connect!
es: ¡Conectémonos!
pt: Vamos nos conectar!

source: Leveraging <0>GenAI</0> to drive <1>next-generation solutions.</1>
es: Aprovechando <0>GenAI</0> para impulsar <1>soluciones de próxima generación.</1>
pt: Aproveitando <0>GenAI</0> para impulsionar <1>soluções de próxima geração.</1>

source: Lifelong Learning
es: Aprendizaje permanente
pt: Aprendizagem ao longo da vida

source: Lifetime Timeline
es: Cronología de Vida
pt: Linha do Tempo da Vida

source: Maintained Java AGETIC system with optimized PostgreSQL queries.
es: Mantuve el sistema Java AGETIC con consultas PostgreSQL optimizadas.
pt: Mantive sistema Java AGETIC com queries PostgreSQL otimizadas.

source: Maintained Node.js and React apps for 100K+ users.
es: Mantuve aplicaciones Node.js y React para más de 100K usuarios.
pt: Mantive aplicações Node.js e React para mais de 100 mil usuários.

source: Maintained production Node.js and React applications serving 100K+ users. Refactored CRM code and implemented Agile best practices.
es: Mantuve aplicaciones Node.js y React en producción que atendían a más de 100K usuarios. Refactoricé el código del CRM e implementé mejores prácticas ágiles.
pt: Mantive aplicações Node.js e React em produção para mais de 100 mil usuários. Refatorei código de CRM e implementei práticas ágeis.

source: May
pt: Mai

source: Mid-Level Developer – PIME
es: Desarrollador de Nivel Medio – PIME
pt: Desenvolvedor Pleno – PIME

source: Mid-level Software Developer
es: Desarrollador de Software de Nivel Medio
pt: Desenvolvedor de Software Pleno

source: Mid-level Software Engineer
es: Ingeniero de Software de Nivel Medio
pt: Engenheiro de Software Pleno

source: Mideal blockchain contract system showing document verification interface
es: Sistema de contratos blockchain Mideal mostrando la interfaz de verificación de documentos
pt: Sistema de contrato blockchain Mideal mostrando interface de verificação de documentos
